layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 160
      dim: 160
    }
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_1a_3x3_Conv2D"
  type: "Convolution"
  bottom: "input"
  top: "InceptionResnetV1_Conv2d_1a_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_1a_3x3_Conv2D"
  top: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_1a_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Conv2d_2a_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_1a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2a_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_2a_3x3_Conv2D"
  top: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2a_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Conv2d_2b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_2a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2b_3x3_Conv2D"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_2b_3x3_Conv2D"
  top: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_2b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_MaxPool_3a_3x3_MaxPool"
  type: "Pooling"
  bottom: "InceptionResnetV1_Conv2d_2b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_MaxPool_3a_3x3_MaxPool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_3b_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_MaxPool_3a_3x3_MaxPool"
  top: "InceptionResnetV1_Conv2d_3b_1x1_Conv2D"
  convolution_param {
    num_output: 80
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_3b_1x1_Conv2D"
  top: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_3b_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Conv2d_4a_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_3b_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4a_3x3_Conv2D"
  convolution_param {
    num_output: 192
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_4a_3x3_Conv2D"
  top: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4a_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Conv2d_4b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_4a_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4b_3x3_Conv2D"
  convolution_param {
    num_output: 256
    bias_term: false
    group: 1
    stride: 2
    pad_h: 0
    pad_w: 0
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_Conv2D"
  top: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Conv2d_4b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_concat"
  type: "Concat"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_concat"
  top: "InceptionResnetV1_Repeat_block35_1_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_mul"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_1_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_Conv2d_1x1_Conv2D"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_add"
  type: "Eltwise"
  bottom: "InceptionResnetV1_Conv2d_4b_3x3_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_1_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_1_add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_1_add"
  top: "InceptionResnetV1_Repeat_block35_1_add"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_add"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_add"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_1_add"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_concat"
  type: "Concat"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_concat"
  top: "InceptionResnetV1_Repeat_block35_2_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_mul"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_2_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_Conv2d_1x1_Conv2D"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_add"
  type: "Eltwise"
  bottom: "InceptionResnetV1_Repeat_block35_1_add"
  bottom: "InceptionResnetV1_Repeat_block35_2_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_2_add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_2_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_2_add"
  top: "InceptionResnetV1_Repeat_block35_2_add"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_add"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_add"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_2_add"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_concat"
  type: "Concat"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_concat"
  top: "InceptionResnetV1_Repeat_block35_3_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_mul"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_3_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_Conv2d_1x1_Conv2D"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_add"
  type: "Eltwise"
  bottom: "InceptionResnetV1_Repeat_block35_2_add"
  bottom: "InceptionResnetV1_Repeat_block35_3_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_3_add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_3_add"
  top: "InceptionResnetV1_Repeat_block35_3_add"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_add"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_add"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_3_add"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_concat"
  type: "Concat"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_1_Conv2d_0b_3x3_BatchNorm_FusedBatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_4_Branch_2_Conv2d_0c_3x3_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_concat"
  top: "InceptionResnetV1_Repeat_block35_4_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_mul"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_4_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_Conv2d_1x1_Conv2D"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_add"
  type: "Eltwise"
  bottom: "InceptionResnetV1_Repeat_block35_3_add"
  bottom: "InceptionResnetV1_Repeat_block35_4_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_4_add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_4_Relu"
  type: "ReLU"
  bottom: "InceptionResnetV1_Repeat_block35_4_add"
  top: "InceptionResnetV1_Repeat_block35_4_add"
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_add"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_add"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_2_Conv2d_0a_1x1_Conv2D"
  type: "Convolution"
  bottom: "InceptionResnetV1_Repeat_block35_4_add"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_2_Conv2d_0a_1x1_Conv2D"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_0_Conv2d_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm_scale"
  type: "Scale"
  bottom: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_1_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "InceptionResnetV1_Repeat_block35_5_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1_Repeat_block35_5_Branch_2_Conv2d_0a_1x1_Conv2D"
  top: "InceptionResnetV1_Repeat_block35_5_Branch_2_Conv2d_0a_1x1_BatchNorm_FusedBatchNorm"
  batch_norm_param {
